In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt 
import seaborn as sns

In [154]:
name=['mamali','mitali','rupali']
roll=[23,30,23]
pd.DataFrame(zip(name,roll))

        0   1
0  mamali  23
1  mitali  30
2  rupali  23

In [156]:
name=['mamali','mirali','gitali']
roll =[22,22,21]
pd.DataFrame(zip(name,roll),columns=['name','roll'])

     name  roll
0  mamali    22
1  mirali    22
2  gitali    21

In [158]:
name=['mamali','bitali','pritali']
roll=[22,21,23]
idx=[1,2,3]
pd.DataFrame(zip(name,roll),index=idx,columns=['Name','Roll'])

      Name  Roll
1   mamali    22
2   bitali    21
3  pritali    23

**blank data frame**

In [161]:
df=pd.DataFrame()

In [163]:
df

Empty DataFrame
Columns: []
Index: []

In [165]:
name=['mamali','mitali','gitali']
df['Name']=name
df['roll']=[20,30,31]

In [167]:
df

     Name  roll
0  mamali    20
1  mitali    30
2  gitali    31

In [169]:
df['roll']

0    20
1    30
2    31
Name: roll, dtype: int64

In [171]:
df['Name']

0    mamali
1    mitali
2    gitali
Name: Name, dtype: object

In [173]:
df['age']=[22,21,20]

In [175]:
df

     Name  roll  age
0  mamali    20   22
1  mitali    30   21
2  gitali    31   20

In [177]:
df.drop(2)

     Name  roll  age
0  mamali    20   22
1  mitali    30   21

In [179]:
df.drop([2])

     Name  roll  age
0  mamali    20   22
1  mitali    30   21

In [181]:
df['mark']=[200,300,400]

In [183]:
df.drop(2,axis=0)

     Name  roll  age  mark
0  mamali    20   22   200
1  mitali    30   21   300

In [185]:
df.drop(2,axis=1) #error for axis

KeyError: '[2] not found in axis'

In [187]:
df.drop(20)   # not found

KeyError: '[20] not found in axis'

In [189]:
df.drop([1,2])

     Name  roll  age  mark
0  mamali    20   22   200

In [191]:
df.drop(columns=['age'])

     Name  roll  mark
0  mamali    20   200
1  mitali    30   300
2  gitali    31   400

In [193]:
df.drop('roll',axis=1)

     Name  age  mark
0  mamali   22   200
1  mitali   21   300
2  gitali   20   400

In [195]:
df.drop('age',axis=1)

     Name  roll  mark
0  mamali    20   200
1  mitali    30   300
2  gitali    31   400

In [197]:
df.drop(labels=[2])

     Name  roll  age  mark
0  mamali    20   22   200
1  mitali    30   21   300

In [199]:
df.drop(columns=['age'],inplace=False)# if we will write true here it will delete te  columjn permanently

     Name  roll  mark
0  mamali    20   200
1  mitali    30   300
2  gitali    31   400

In [201]:
df

     Name  roll  age  mark
0  mamali    20   22   200
1  mitali    30   21   300
2  gitali    31   20   400

In [203]:
df.drop_duplicates

<bound method DataFrame.drop_duplicates of      Name  roll  age  mark
0  mamali    20   22   200
1  mitali    30   21   300
2  gitali    31   20   400>

In [205]:
dataframe=pd.DataFrame()

In [207]:
dataframe['name']=['a','a','a','d']
dataframe['age']=[23,23,24,25]
dataframe['mark']=[200,205,208,240]

In [209]:
dataframe

  name  age  mark
0    a   23   200
1    a   23   205
2    a   24   208
3    d   25   240

In [211]:
dataframe.duplicated().sum()

0

In [213]:
dataframe.duplicated('mark').sum()

0

In [215]:
drop_value=dataframe.drop_duplicates()
print(drop_value)

  name  age  mark
0    a   23   200
1    a   23   205
2    a   24   208
3    d   25   240

In [218]:
df.dtypes

Name    object
roll     int64
age      int64
mark     int64
dtype: object

In [220]:
drop_value

  name  age  mark
0    a   23   200
1    a   23   205
2    a   24   208
3    d   25   240

In [106]:
import pandas as pd

df = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Alice', 'David'],
    'age': [5, 30, 5, 40]
})

df_clean = df.drop_duplicates()
print(df_clean)

    name  age
0  Alice    5
1    Bob   30
3  David   40

In [223]:
df

     Name  roll  age  mark
0  mamali    20   22   200
1  mitali    30   21   300
2  gitali    31   20   400

In [227]:
df.drop(['Name','age'],axis=1)

   roll  mark
0    20   200
1    30   300
2    31   400

In [229]:
df.drop(columns=['Name','age'])

   roll  mark
0    20   200
1    30   300
2    31   400

In [231]:
df.columns
dict1={'Mark':'mark'}
df.rename(dict1,axis=1)#..........this is how the renamer actualy works like

     Name  roll  age  mark
0  mamali    20   22   200
1  mitali    30   21   300
2  gitali    31   20   400

In [233]:
df.rename(columns=dict1)

     Name  roll  age  mark
0  mamali    20   22   200
1  mitali    30   21   300
2  gitali    31   20   400

In [237]:
df.columns=['a','b','c','d']
df.index=[1,2,3]

In [239]:
df

        a   b   c    d
1  mamali  20  22  200
2  mitali  30  21  300
3  gitali  31  20  400

In [241]:
df.columns=['Name','Age','Sage','Mark']
df.index=[0,1,2]
df

     Name  Age  Sage  Mark
0  mamali   20    22   200
1  mitali   30    21   300
2  gitali   31    20   400

In [243]:
#append------------------rows
df.loc[2]

Name    gitali
Age         31
Sage        20
Mark       400
Name: 2, dtype: object

In [245]:
df.loc[[2]]

     Name  Age  Sage  Mark
2  gitali   31    20   400

In [247]:
df.loc[[1,2]]

     Name  Age  Sage  Mark
1  mitali   30    21   300
2  gitali   31    20   400

In [257]:
df.loc[[1,2],['Sage','Age']]

   Sage  Age
1    21   30
2    20   31

In [259]:
df.loc[:,['Sage','Age']]

   Sage  Age
0    22   20
1    21   30
2    20   31

In [261]:
df.loc[[2]]

     Name  Age  Sage  Mark
2  gitali   31    20   400

In [263]:
df.loc[2,['Age']]

Age    31
Name: 2, dtype: object

In [265]:
df.loc[[2],['Age']]

   Age
2   31

In [279]:
df.iloc[[2],[2]]

   Sage
2    20

In [301]:
df.iloc[[1,2]]

     Name  Age  Sage  Mark
1  mitali   30    21   300
2  gitali   31    20   400

In [303]:
df.iloc[2,2]

20

In [307]:
path1=r"C:\Users\ASUS\Documents\python\Practice\pandass_practice\python_practice_8.csv"
path2=r"python_practice_8.csv"
path3=r"C:\Users\ASUS\Documents\python\Practice\pandass_practice\python_practice_8.xlsx"
path4=r"python_practice_8.xlsx"

In [315]:
df.to_csv(path1,index=False)
df.to_csv(path3,index=True)

In [311]:
path2

'python_practice_8.csv'

**data quick checks**

In [3]:
path1=r"C:\Users\ASUS\Documents\python\Practice\pandass_practice\Visadataset.csv"
visa_df=pd.read_csv(path1)

In [322]:
visa_df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [326]:
visa_df.shape

(25480, 12)

In [330]:
visa_df.min()

case_id                      EZYV01
continent                    Africa
education_of_employee    Bachelor's
has_job_experience                N
requires_job_training             N
no_of_employees                 -26
yr_of_estab                    1800
region_of_employment         Island
prevailing_wage              2.1367
unit_of_wage                   Hour
full_time_position                N
case_status               Certified
dtype: object

In [334]:
visa_df.max()

case_id                       EZYV9999
continent                South America
education_of_employee         Master's
has_job_experience                   Y
requires_job_training                Y
no_of_employees                 602069
yr_of_estab                       2016
region_of_employment              West
prevailing_wage              319210.27
unit_of_wage                      Year
full_time_position                   Y
case_status                     Denied
dtype: object

In [336]:
visa_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25480 entries, 0 to 25479
Data columns (total 12 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   case_id                25480 non-null  object
 1   continent              25480 non-null  object
 2   education_of_employee  25480 non-null  object
 3   has_job_experience     25480 non-null  object
 4   requires_job_training  25480 non-null  object
 5   no_of_employees        25480 non-null  int64
 6   yr_of_estab            25480 non-null  int64
 7   region_of_employment   25480 non-null  object
 8   prevailing_wage        25480 non-null  float64
 9   unit_of_wage           25480 non-null  object
 10  full_time_position     25480 non-null  object
 11  case_status            25480 non-null  object
dtypes: float64(1), int64(2), object(9)
memory usage: 2.3+ MB

In [338]:
visa_df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [340]:
visa_df.index

RangeIndex(start=0, stop=25480, step=1)

In [348]:
visa_df.isnull().sum()

case_id                  0
continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

In [352]:
visa_df.count()

case_id                  25480
continent                25480
education_of_employee    25480
has_job_experience       25480
requires_job_training    25480
no_of_employees          25480
yr_of_estab              25480
region_of_employment     25480
prevailing_wage          25480
unit_of_wage             25480
full_time_position       25480
case_status              25480
dtype: int64

In [362]:
cup_valu=visa_df.copy()

In [366]:
#cup_valu

In [368]:
df=pd.DataFrame(visa_df.dtypes,columns=['Types'])

                         Types
case_id                 object
continent               object
education_of_employee   object
has_job_experience      object
requires_job_training   object
no_of_employees          int64
yr_of_estab              int64
region_of_employment    object
prevailing_wage        float64
unit_of_wage            object
full_time_position      object
case_status             object

In [372]:
df=pd.DataFrame(visa_df.dtypes,columns=['Type'])
df.reset_index(inplace=True)
df.rename(columns={'index':'columns'},inplace=True)

In [374]:
df

                  columns     Type
0                 case_id   object
1               continent   object
2   education_of_employee   object
3      has_job_experience   object
4   requires_job_training   object
5         no_of_employees    int64
6             yr_of_estab    int64
7    region_of_employment   object
8         prevailing_wage  float64
9            unit_of_wage   object
10     full_time_position   object
11            case_status   object

In [376]:
visa_df.dtypes.to_dict()

{'case_id': dtype('O'),
 'continent': dtype('O'),
 'education_of_employee': dtype('O'),
 'has_job_experience': dtype('O'),
 'requires_job_training': dtype('O'),
 'no_of_employees': dtype('int64'),
 'yr_of_estab': dtype('int64'),
 'region_of_employment': dtype('O'),
 'prevailing_wage': dtype('float64'),
 'unit_of_wage': dtype('O'),
 'full_time_position': dtype('O'),
 'case_status': dtype('O')}

In [378]:
visa_df.dtypes.to_dict().keys()

dict_keys(['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'no_of_employees', 'yr_of_estab', 'region_of_employment', 'prevailing_wage', 'unit_of_wage', 'full_time_position', 'case_status'])

In [382]:
list(visa_df.dtypes.to_dict().keys())

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [386]:
list(visa_df.dtypes.to_dict().values())

[dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('float64'),
 dtype('O'),
 dtype('O'),
 dtype('O')]

**task=2**

- extract categorical and umerical in the list

In [390]:
types=visa_df.dtypes.to_dict().values()
for i in types:
    print(i)

object
object
object
object
object
int64
int64
object
float64
object
object
object

In [394]:
list(types)

[dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('float64'),
 dtype('O'),
 dtype('O'),
 dtype('O')]

In [396]:
visa_df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [408]:
types=visa_df.dtypes.to_dict().values()
for i in types:
    print(i)

object
object
object
object
object
int64
int64
object
float64
object
object
object

In [410]:
types

dict_values([dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('int64'), dtype('int64'), dtype('O'), dtype('float64'), dtype('O'), dtype('O'), dtype('O')])

In [416]:
num=[]
cat=[]
data_types=visa_df.dtypes.to_dict().items()
for i,j in data_types:
    if j=='object':
        cat.append(i)
    else:
        num.append(i)

In [418]:
num

['no_of_employees', 'yr_of_estab', 'prevailing_wage']

In [421]:
cat

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'region_of_employment',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [423]:
data_types=visa_df.dtypes.to_dict().items()
cat=[i for i,j in data_types if j=='object']
num=[i for i ,j in data_types if j!='object']

In [425]:
cat

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'region_of_employment',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [427]:
num

['no_of_employees', 'yr_of_estab', 'prevailing_wage']

 - select_dtypes

In [434]:
visa_df.select_dtypes(include='object').columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [438]:
visa_df.select_dtypes(exclude='object').columns

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')

In [452]:

types=visa_df.dtypes.to_dict().items()

In [454]:
types

dict_items([('case_id', dtype('O')), ('continent', dtype('O')), ('education_of_employee', dtype('O')), ('has_job_experience', dtype('O')), ('requires_job_training', dtype('O')), ('no_of_employees', dtype('int64')), ('yr_of_estab', dtype('int64')), ('region_of_employment', dtype('O')), ('prevailing_wage', dtype('float64')), ('unit_of_wage', dtype('O')), ('full_time_position', dtype('O')), ('case_status', dtype('O'))])

In [460]:
types=visa_df.dtypes.to_dict()
cat=[i for i,j in types.items() if j=='object']
num=[i for i ,j in types.items()if j!='object']

In [462]:
num,cat

(['no_of_employees', 'yr_of_estab', 'prevailing_wage'],
 ['case_id',
  'continent',
  'education_of_employee',
  'has_job_experience',
  'requires_job_training',
  'region_of_employment',
  'unit_of_wage',
  'full_time_position',
  'case_status'])

In [464]:
cat=visa_df.select_dtypes(include='object').columns
num=visa_df.select_dtypes(exclude='object').columns

In [466]:
cat,num

(Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
        'requires_job_training', 'region_of_employment', 'unit_of_wage',
        'full_time_position', 'case_status'],
       dtype='object'),
 Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object'))

In [468]:
visa_df['continent']

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object

In [470]:
cols=['continent','case_status']
visa_df[cols]

      continent case_status
0          Asia      Denied
1          Asia   Certified
2          Asia      Denied
3          Asia      Denied
4        Africa   Certified
...         ...         ...
25475      Asia   Certified
25476      Asia   Certified
25477      Asia   Certified
25478      Asia   Certified
25479      Asia   Certified

[25480 rows x 2 columns]

In [474]:
visa_df[['continent']]

      continent
0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
...         ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia

[25480 rows x 1 columns]

In [478]:
visa_df.loc[:,['continent']]

      continent
0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
...         ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia

[25480 rows x 1 columns]

In [486]:
visa_df.loc[:,'continent']

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object

In [498]:
Id=cat.to_list().index('continent')
visa_df.iloc[:,Id]
#visa_df.iloc[:,[Id]]

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object

In [492]:
Id

1

In [500]:
visa_df['continent']

0          Asia
1          Asia
2          Asia
3          Asia
4        Africa
          ...
25475      Asia
25476      Asia
25477      Asia
25478      Asia
25479      Asia
Name: continent, Length: 25480, dtype: object

In [502]:
visa_df['continent'].values

array(['Asia', 'Asia', 'Asia', ..., 'Asia', 'Asia', 'Asia'], dtype=object)

In [504]:
len(visa_df['continent'].values)

25480

 -unique

In [509]:
visa_df['continent'].unique()

array(['Asia', 'Africa', 'North America', 'Europe', 'South America',
       'Oceania'], dtype=object)

In [511]:
visa_df['continent'].nunique()

6

 - how many applicants are from asia

In [516]:
con=visa_df['continent']=='Asia'

In [518]:
con

0         True
1         True
2         True
3         True
4        False
         ...
25475     True
25476     True
25477     True
25478     True
25479     True
Name: continent, Length: 25480, dtype: bool

In [520]:
len(con)

25480

In [522]:
len(visa_df[con])

16861

In [7]:
visa_df['continent'].value_counts()

continent
Asia             16861
Europe            3732
North America     3292
South America      852
Africa             551
Oceania            192
Name: count, dtype: int64

In [9]:
keys=visa_df['continent'].value_counts().keys()

In [11]:
keys

Index(['Asia', 'Europe', 'North America', 'South America', 'Africa',
       'Oceania'],
      dtype='object', name='continent')

In [13]:
values=visa_df['continent'].value_counts().values

In [15]:
values

array([16861,  3732,  3292,   852,   551,   192], dtype=int64)

In [27]:
keys=visa_df['continent'].value_counts().keys()
values=visa_df['continent'].value_counts().values
df=pd.DataFrame(zip(keys,values),
                columns=['Continent','number of applicants'])
df.to_csv('continent_df.csv')

In [29]:
df

       Continent  number of applicants
0           Asia                 16861
1         Europe                  3732
2  North America                  3292
3  South America                   852
4         Africa                   551
5        Oceania                   192

 - create new folder